# ConduitSizeIterator Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSizeIterator Methods
ConduitSizeIterator Class See Also
---
The ConduitSizeIterator type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCurrent | Returns the current ConduitSize. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| HasCurrent | Identifies if the iterator has a current item. |
| IsDone | Identifies if the iteration has completed. |
| MoveNext | Increments the iterator to the next item. |
| Reset | Resets the iterator to the initial state. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace